---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TableSectionData..::..GetCellCalculatedValue Method
TableSectionData Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetCellCalculatedValue(Int32) | Gets the calculated value for the specified column |
|  | GetCellCalculatedValue(Int32, Int32) | Gets the calculated value for the specified cell |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace